var Available = [3,3,2],//当前可用资源
	//各进程对A B C 类资源的最大需求量
	Max = [
			[7,5,3],
			[3,2,2],
			[9,0,2],
			[2,2,2],
			[4,3,3]
		],
	//各进程现已分配的A B C 类资源数量
	Allocation = [
			[0,1,0],
			[2,0,0],
			[3,0,2],
			[2,1,1],
			[0,0,2]
		],
	//各进程仍需要的A B C 类资源数量
	Need = [
			[7,4,3],
			[1,2,2],
			[6,0,0],
			[0,1,1],
			[4,3,1]
		];

/*var Available = [1,6,2,2],//当前可用资源
	//各进程对A B C 类资源的最大需求量
	//若Max没有给出，写法如下所示
	Max = [
			// [7,5,3],
			// [3,2,2],
			// [9,0,2],
			// [2,2,2],
			// [4,3,3]
		],
	//各进程现已分配的A B C 类资源数量
	Allocation = [
			[0,0,3,2],
			[1,0,0,0],
			[1,3,5,4],
			[0,3,3,2],
			[0,0,1,4]
		],
	//各进程仍需要的A B C 类资源数量
	Need = [
			[0,0,1,2],
			[1,7,5,0],
			[2,3,5,6],
			[0,6,5,2],
			[0,6,5,6]
		];*/